app/controllers/movies_controller.rb

    end

   ##pull in movies in sorted order
    @movies = Movie.order(session[:sort_by])
---
SELECT "movies".* FROM "movies" WHERE (title != '') ORDER BY release_date